#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/zcipod/terraform_study/runs/run-xDPBb1Pr2VBAnggF

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_compute_network.vpc_network: Refreshing state... [id=projects/kube-293902/global/networks/kubernetes-the-hard-way]
google_compute_address.public_address: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/addresses/kubernetes-the-hard-way]
google_compute_http_health_check.kubernetes: Refreshing state... [id=projects/kube-293902/global/httpHealthChecks/kubernetes]
tls_private_key.admin: Refreshing state... [id=1cbc7b5dfecc01450311bd213329540dc6cbb1ae]
tls_private_key.ssh-key: Refreshing state... [id=a5825dfb2c334dfd3d5f31ef1df2a302e31ef941]
tls_private_key.scheduler: Refreshing state... [id=dd28fba37a93e3cfa5aa25dd4fc640c83966373d]
tls_private_key.api-server: Refreshing state... [id=ee4c571f867f4098e78275188a07ebf7055ebe81]
tls_private_key.proxy: Refreshing state... [id=4b1386401195f2cadbafeb2a70e3c9f83f15fa39]
tls_private_key.ca: Refreshing state... [id=90e935f430562c752939826279ae486bf2b75274]
tls_private_key.controller: Refreshing state... [id=979a91eed3d21c976930ec529053efc0936bca4c]
tls_private_key.service-account: Refreshing state... [id=690ba0a278fb00be06461fc34814840146affb6b]
tls_cert_request.proxy: Refreshing state... [id=ae0471886842aea886b2b584f57fdecf486c6d59]
tls_cert_request.scheduler: Refreshing state... [id=06c4bf91d4704cbca414c129fc14b56c03ab347b]
tls_self_signed_cert.ca: Refreshing state... [id=210517645870448300031839919003293893346]
tls_cert_request.admin: Refreshing state... [id=f02b62f95b97617f577dfe216a77c88471f9adbd]
tls_cert_request.service-account: Refreshing state... [id=6ea883757c2835a2e376a230cb78aec5c1cb0afd]
tls_locally_signed_cert.scheduler: Refreshing state... [id=291188124759177099914219354710224305028]
tls_locally_signed_cert.proxy: Refreshing state... [id=42235547551512220690076888455816264675]
tls_cert_request.controller: Refreshing state... [id=826854ab8fca69b098cecc48f5a615fd1efeab9b]
tls_locally_signed_cert.admin: Refreshing state... [id=15498459925223107039757570207176391697]
tls_locally_signed_cert.service-account: Refreshing state... [id=134419440858130733582403061241746626331]
tls_locally_signed_cert.controller: Refreshing state... [id=260137955462882075220461625087901531374]
tls_cert_request.api-server: Refreshing state... [id=8a5006ed2b0feedb4007f51f5ab0fe41abf001e1]
tls_locally_signed_cert.api-server: Refreshing state... [id=23337751792765683688805456524533282507]
google_compute_firewall.firewall-allow-internal: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-internal]
google_compute_firewall.firewall-allow-health-check: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-health-check]
google_compute_firewall.firewall-allow-external: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-external]
google_compute_target_pool.target-pool: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/targetPools/kubernetes-target-pool]
google_compute_firewall.firewall-allow-worker-0-nodeport: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-nginx-service]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes]
google_compute_forwarding_rule.forwarding-rule: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/forwardingRules/kubernetes-forwarding-rule]
google_compute_instance.controller[0]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/controller-0]
google_compute_instance.worker[0]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/worker-0]
google_compute_route.route[2]: Refreshing state... [id=projects/kube-293902/global/routes/kubernetes-route-10-200-2-0-24]
google_compute_route.route[1]: Refreshing state... [id=projects/kube-293902/global/routes/kubernetes-route-10-200-1-0-24]
google_compute_instance.worker[2]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/worker-2]
google_compute_instance.worker[1]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/worker-1]
google_compute_route.route[0]: Refreshing state... [id=projects/kube-293902/global/routes/kubernetes-route-10-200-0-0-24]
kubernetes_deployment.nginx: Refreshing state... [id=default/scalable-nginx-example]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.controller[0] must be replaced
-/+ resource "google_compute_instance" "controller" {
        can_ip_forward          = true
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/kube-293902/zones/australia-southeast1-a/instances/controller-0" -> (known after apply)
      ~ instance_id             = "2761559025967406684" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "e2-micro"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "_Lcmmmo-pD0=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            cat > ~/ca.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDsjCCApqgAwIBAgIRAJ5gOUr7UsggwdD138AKwuIwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDQwMzEzNDVaFw0yMTExMDQwMzEzNDVaMGMxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczELMAkGA1UECxMCQ0ExEzARBgNVBAMTCkt1YmVybmV0ZXMwggEiMA0G
            CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC+sLEkZL9XE2LfOPv+Ln6SIRrLbFWQ
            UgViE2T7Ac5qrq7lpu9Fu9SJHzvMOgD5TC9x2kCXeODddJyA5ev4OvsfI95Nq3Lw
            go9udNZD9f0pM3dQjRQHD5/SNVdkl4gRmaV/nddpBPZ74VhDZIjSHFkYvthYvyu+
            rpzMtb9g3bWkXr2yTV3IxvpRe5VdND+ofMOvvqaIPQZZ33MdgcrzrzkvjfvFHTby
            91l4Dv478g/pQGpgcIL69z8GfuJJlh5A6bm27batckDmKkZBh26Ntvf/O+R5xKgB
            qvMY40mbPXeOMupJoBUel0EZq9pjsmHAeAGbQCwLNyb27+jlqNdDzRWDAgMBAAGj
            YTBfMA4GA1UdDwEB/wQEAwICJDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUH
            AwIwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQUF3y3UZI0eYG8bdSVnoeTiMgP
            iecwDQYJKoZIhvcNAQELBQADggEBAExDl0D2TwVKByAeOpja5S2MYtIcHs9iTHXI
            fLXS0W18ki7UAV5IR49HO0t4AyUlQ3oqT/qs14K1HjwrSRVsjUBl1NgkNCOtlNNX
            P48fpqrCdzZJuyJcx6cmU9gpVi+Ft0NoBXXVW6QK78L9psobYzJ5r+bTnikqUOPc
            Mkmui5yiFIHsZ8LNjyDFRk8cMIxxRa4eiELZof8Vrq+oicM80ALw8t2yiLAIbnik
            jHT8Se7AHD6A/JrQsEDJqgpz4l6/orm50mfXp5ckivseZNH4ZFCIi3FHukvYx7Lp
            G8v+Gh8DgXLxYPJ6kJpBGFgaJ75uu/GLMKKupSbzu1FnZcKaIKs=
            -----END CERTIFICATE-----
            EOF
            cat > ~/ca-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEogIBAAKCAQEAvrCxJGS/VxNi3zj7/i5+kiEay2xVkFIFYhNk+wHOaq6u5abv
            RbvUiR87zDoA+UwvcdpAl3jg3XScgOXr+Dr7HyPeTaty8IKPbnTWQ/X9KTN3UI0U
            Bw+f0jVXZJeIEZmlf53XaQT2e+FYQ2SI0hxZGL7YWL8rvq6czLW/YN21pF69sk1d
            yMb6UXuVXTQ/qHzDr76miD0GWd9zHYHK8685L437xR028vdZeA7+O/IP6UBqYHCC
            +vc/Bn7iSZYeQOm5tu22rXJA5ipGQYdujbb3/zvkecSoAarzGONJmz13jjLqSaAV
            HpdBGavaY7JhwHgBm0AsCzcm9u/o5ajXQ80VgwIDAQABAoIBAHa7QbDtYg3vrjJb
            ItwjSv/lyO88ZxJTX7KvbMK1XzchyRiJFpaO20j9v5frzctr2mbDhFBMHYcGIqRH
            hOOspcu/45zs0cZbJL+b1AXA1n6e4v2uufejjNmwCNhDWZ/L0TZiq0tioa6EoxZj
            NKXOrNMxkTfA4JX71vnHeH/xzDWpCp6X9WsNKPFe96xmvemI6ez+x9fcethIROgE
            Tvz+rgiCQ/j7oLJoM/MdRvWnPJCdHhHSibIZ7k13fRr0GT+QO7tgnlhOBU0HTj8L
            rHGIFZb2ZtquQ0WqOiN05vbrtRrHZnm99Z85a4tHJkauF25sqOMEi8FRKdsfWPDQ
            UONgX1ECgYEAwwZneucj4fc+PdIY7nUqO599SY6UxINIVkY/0/mp0an8lk5MPTi3
            /Zpdc5PCWBGu9QLyujCUX6KPb5q0/mFN4VHCI13zgEYmVRv10gnsnh6AbzsWYo14
            cOqStnJOSWmrZDwqSSWJ+6cKFCQyuPMdV2SnZSLotBFKWjJ91O7jqfcCgYEA+k9V
            d9w2jK/DAB5eyz6/aB50TKjtPLOgelpn2dV8XsgNtfJIc6K6e2a9FaYTxjJsnZxS
            43lyXagHuSH6yD8CGL1TECljFqEdoW6ugr92I9SjB6A9ld6DPP9ulcVUovQulNap
            9ZjSLot4koErFAO4cmFfqEsPOpIs5A6qqnpx7dUCgYBlJoIvTYjf30Np/vktXJl9
            +RebOhdQ4SJ4lNDwGZKJixfVwWBrdGqBXznPAzkOQoWy0EeiaCXcgEzSvrPXKBKj
            pasCeu0bf8bL58eUm88cp4dHqabPkL6CGjfj5t9R1jutrkLkU1MAsb9ZePjR0k5K
            kIr9uqBlHH6qz3tSIGD2OwKBgCPOe3x07Py9G9kFfyv14u2jBaH9vEolq/w0uIxp
            xKvOVF/Fs+WOzrxeWwggxM1iYzU8qoLN2bVaFxi9qqFAmi0t0BcMxJb1H0b7jU04
            1E6V2Wh63LR2qzFrnMch/lR9N7ik6JUwckikPPBAOAhZ6+W41jU934TSakeJbZKL
            h4atAoGAG2C/P98/ayvNelW+qflB2YmZQGvi81iuwkCL+oXcqCcm7h+B3j5BfDsw
            HTCXC99xL9jCG2DW478F16XSi9fb1P5v8YowZCUlZzdrh8+PmhikP0nwmzN5Xbqe
            gYGL8dpCqylFWN692DHUIl1vGKtaNlGyfb4PmfJOQU29CyuppFc=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kubernetes.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIEcTCCA1mgAwIBAgIQEY6wABS+cCHhjGN/eXO2yzANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwNDAzMTM0NloXDTIxMTEwNDAzMTM0NloweDELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMwEQYDVQQKEwpLdWJl
            cm5ldGVzMSAwHgYDVQQLExdLdWJlcm5ldGVzIFRoZSBIYXJkIFdheTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAL/9
            Ezavbd+Zf8AVDIo1golZ2nC1lPl6y9Tzb2uDXClWZg5KTjRRzfshML3PJ0Xuarou
            vMGG380DL1B5ujM2ZyRq9xhHsAPVuWFSxlJJedTndzNxHT6OvrDgompIfME4GRl+
            QcaDP4rYwwArIU/H+5uDKjIQigDBOJrhDvA0ZAub+6ClQLMVJY/Q6uXZBRw1XqiE
            mESTW2Go3tdjblzwgmE/WCtXXqLmfJri8Vte9CLHfw287pn7YRw/8uYPtLWfmdAj
            2NwHzqQOEXWiVDbVq37QlJo4kqjSSOJinVBg1ZK9ByEofDjSh8Qs288xxuM7hQoF
            meQn/eRm7RnLPIm9IeECAwEAAaOCAQowggEGMA4GA1UdDwEB/wQEAwIFoDAdBgNV
            HSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAfBgNVHSME
            GDAWgBQXfLdRkjR5gbxt1JWeh5OIyA+J5zCBpQYDVR0RBIGdMIGaggprdWJlcm5l
            dGVzghJrdWJlcm5ldGVzLmRlZmF1bHSCFmt1YmVybmV0ZXMuZGVmYXVsdC5zdmOC
            Hmt1YmVybmV0ZXMuZGVmYXVsdC5zdmMuY2x1c3RlcoIca3ViZXJuZXRlcy5zdmMu
            Y2x1c3Rlci5sb2NhbIcECiAAAYcEfwAAAYcEIlfQB4cECvAACocECvAAC4cECvAA
            DDANBgkqhkiG9w0BAQsFAAOCAQEAHaf2FuKk/1GVyFlk0hpBNd72TL+aOw+LjXF4
            0bpBOl43RlPeX44M7uyF+USpTHadgzn0EkcXWd8b6TTR78bX8Uu22Sy471w+R/Qo
            W3yBhf+3oiqSOSY1jMqubHOV5M9Yvg9iOt6mVGkccj3vd0oSGRcRQPjUoY2vqXL7
            InjJLsBpYoHBQpWA9kqGtcvZ104uzPcLYzODzeCYVm8YyVATO07+kBP8LCQiPV0j
            n0o2Oy4EcitmY2m7eDLoPwIpJna+1L3qnG65mLpPdCQPaugoE8fRGN5Ov1DGcSzO
            19f0KafIJxQKec2yFJjo4shyptwTIHfJyUv7XYNwSUv26CzSuA==
            -----END CERTIFICATE-----
            EOF
            cat > ~/kubernetes-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpgIBAAKCAQEAv/0TNq9t35l/wBUMijWCiVnacLWU+XrL1PNva4NcKVZmDkpO
            NFHN+yEwvc8nRe5qui68wYbfzQMvUHm6MzZnJGr3GEewA9W5YVLGUkl51Od3M3Ed
            Po6+sOCiakh8wTgZGX5BxoM/itjDACshT8f7m4MqMhCKAME4muEO8DRkC5v7oKVA
            sxUlj9Dq5dkFHDVeqISYRJNbYaje12NuXPCCYT9YK1deouZ8muLxW170Isd/Dbzu
            mfthHD/y5g+0tZ+Z0CPY3AfOpA4RdaJUNtWrftCUmjiSqNJI4mKdUGDVkr0HISh8
            ONKHxCzbzzHG4zuFCgWZ5Cf95GbtGcs8ib0h4QIDAQABAoIBAQCnRcxTvQ0x3/+a
            T7yZPn35Rbw4rzyZERA+/cp6Ff1aVticYsk4dH3O6+AXwEErgMqkZMw4oVakvL2g
            lC5TKHc9F6UqFmuZK8FUtlXso+/uO61zuH4OXzhty4o2p+lqP4I+3+5XE0ttoeZk
            Yy+m30qs997vt9FFTxQOfUASsNLp+P230Rr+9tTQyviL2ZK5tAcC8rLzDVt9wIqZ
            Shm1CrcCK8DH8jBmH017zxVGAf8myhwBhnh78OLHOBCLdnt5GWQ2bee4aUnm6j/C
            jdOJ9QYRZ67lVR6NDawtxFVoTlgyJGsr4dMIIHSe2MFXlXFLfMyZ3vKUcPWO2S4H
            FzldEWZBAoGBAPIT79PRNXwJR0oLJzMek7r7oLAfuoxrKdzBp16BGJL9XUjQepCo
            Dz13vYy+h7THcHvqYePezqr8KY7u6bRJEuc++t8ThXTwm+fE2I/BwbGLdpyZcxE6
            IXGVQC2nZW1z3QM2O5TVLuVNcnKivIgNaE4zDqYLdCyf752KGc/Wjfb1AoGBAMsH
            rwKuHAuNLIegkBNu4wDqe+b4bKPxzCNqO+DOI/Rs7VOuxxqEtuoVOie0rXmsP/25
            TdV51kKPzNQa+9zhvaZkGguicysXTHkBsl9wbkVr7Zh3i3AG9nQBnU1L9l174AuX
            gzDoWVnWIMGVhIC8jCTANYnKcofd39vfFC6c7zO9AoGBANiRm4JtbSL9jgig973V
            AidLDFPk3tjW2onDuj9i0SBXiQgmczBNGe1M3Yg3wGKr9mb1pgPdhhkUJP3Zob0H
            juDQyFGgPkoDJAdyZKgfmHCFK2UoJvhngBoEg3kUhDoqaLSB5UXefujno5cJHg+9
            pu4m4VkNcC6oGw9eyH7XHQStAoGBAIwGJZZ0nBT/bXmwrA0rCdZk4cUfClZbeg3m
            w5s8sKFvypJPVTQd2cVBlJUzz/y9ZnjHpz2WxMWtRXf3kEL7UYADQ89IX6OVcwF1
            wR5/fR3V3MytjfZaZvkE8AcSX7yDpbZ47Vr6tDz4KCk6xGLBJuplwcbhX/ICfNS4
            WsP3KiYFAoGBANBjyH0YgKf0kn6mUm9AL2jk1Qej51UC7MJ4aDAcJsj3lv6Gc026
            MIN6CopBCaANGlzMN4+r4ZbcwUWRa8WgYSwFX6t5wCiMb1nrr2p3MGqco0SAJASV
            Zqpk57sIIKTAkEo09UgwoKnYuWPTOtD/QQNJMe189he5HyFywTCbYWc8
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/service-account.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDyjCCArKgAwIBAgIQZSA+HLbgDmQrxe02qIEXGzANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwNDAzMTM0NVoXDTIxMTEwNDAzMTM0NVowfTELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMwEQYDVQQKEwpLdWJl
            cm5ldGVzMSAwHgYDVQQLExdLdWJlcm5ldGVzIFRoZSBIYXJkIFdheTEYMBYGA1UE
            AxMPc2VydmljZS1hY2NvdW50MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKC
            AQEA3ED+w8yCFxX4Afd4nNDKz1y3xt9f4ht47L+Ajd865+9ZZ77KFXFwYQX7hKk3
            9B1lfgeCCQ+QavaxeY4dGRJUSMKJshfr8F58RHqGOl2x50bC/SiveY1dPlG20fg/
            NnKGkC+SXU8hfyBct6czDjLMiMF+k3Jdxx0nYDE8VuxPUBrQa827pemYFaEgoJ7v
            inGmCZNDlkvdY685F6g91sjicTqMlF01qLqfmTTXMw7xzfRg+ybNaFbeOAnkxgQh
            jU88Ta4bUKymxq3fnHC+gywm7AsDuWbFS5aCE/gWxQMhQehJUSbLV1At0r82pkoL
            kDKlHepJ6vN306HC2zRv2JtVLwIDAQABo2AwXjAOBgNVHQ8BAf8EBAMCBaAwHQYD
            VR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMAwGA1UdEwEB/wQCMAAwHwYDVR0j
            BBgwFoAUF3y3UZI0eYG8bdSVnoeTiMgPiecwDQYJKoZIhvcNAQELBQADggEBAH5z
            qTGqmpjAEAF7zPLi/qk/r502r1HOY267cNgHU7vvLSvWhHNrHSXEQuQ8rRGAooOT
            YJkkwouSXxvboiyHx0yTxXKK1Y4g8FObCZyLqb4mosxBg8MWZPjBXCmQblwiFVL/
            b0IH+YL9H99fkaEKxxYy4gLFYDn4vsFPiqmY6ho3b0kS6HHdejpg06965E9+BFfp
            lxFwQ6tHbBU7lVCSNyqbAeBzzoPu4zh+vTJtOhChJgSXs7seNEdLlE0klLbx+4lm
            1VqJnuFAM8kfSElC/QIKBUUdBIyd1WUETNgG3hAu5cKjyfwnulY+pLF+phSiJeyy
            HHLTN3t/o/TbpaCh54E=
            -----END CERTIFICATE-----
            EOF
            cat > ~/service-account-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEA3ED+w8yCFxX4Afd4nNDKz1y3xt9f4ht47L+Ajd865+9ZZ77K
            FXFwYQX7hKk39B1lfgeCCQ+QavaxeY4dGRJUSMKJshfr8F58RHqGOl2x50bC/Siv
            eY1dPlG20fg/NnKGkC+SXU8hfyBct6czDjLMiMF+k3Jdxx0nYDE8VuxPUBrQa827
            pemYFaEgoJ7vinGmCZNDlkvdY685F6g91sjicTqMlF01qLqfmTTXMw7xzfRg+ybN
            aFbeOAnkxgQhjU88Ta4bUKymxq3fnHC+gywm7AsDuWbFS5aCE/gWxQMhQehJUSbL
            V1At0r82pkoLkDKlHepJ6vN306HC2zRv2JtVLwIDAQABAoIBAGERl/YM5GxuNy4O
            ta5O6oL29tuDyIsq1mFoiKx97EUZnEp3sDJBG2j3LQErXsiMSBWCE5IQtPIfJNpQ
            goxxIooqimrd1hLKYXQAl7WTY3ttGTRfQO6OGcEEXFEvWhSR5rIW9SeAX1/akGI0
            IvEn/DJtLG6pIaFGPPtM163rWY0QYusOItB3wMzf9FXXCyhIMMonxGMseYI6Fsk/
            v0DJkzp0b0Xh9NuHGdbkOM1hspDR3n0i0pS+BW4CPbk75IRQwspSjY6AUOHj01BU
            W+jE7XvEpYxvppPJD5pALd4vnowMVmoFln6F8ULM169e6GEmSDGg72lyMCGBHDRV
            njnBGckCgYEA7P6Dg2gHrUgHpF7yELlmLlZ5S2fg/hgC5PutqjuftLi1FQ3ZW69w
            0WtNV+iIiDlsXELWFUOKZfE/MPTLS5WqrGW9xmftcffqX35bAv4qPpQQdmEKjwdQ
            Fu/xI8D986S6eMXzPtGUDyK0l2JM4xZt9GPR6cv8afrQuI3dvxQKxlsCgYEA7erN
            oz5Y4zOgsH10hq956cAE7pLwGZnwp+1MufrJ/HL9zE80qyvIfGW1FdIhOpvW+Gro
            sVcudiGfMdK/+jm3cvCappol269WOzirQUi2KMGcZN2TE3KW2ZWId+IEIDTpXiZ1
            53og/JVzVpfW+h6uxvBz9cZxBr3DdI+RLwFR7L0CgYAM9d47UXUaBNZmJssWHw13
            e0Mm3IdxXd7KpvjYVmpld7RvclJwsSd6TGPuaskMqhdC9GTAxPDMomTSSJDVkVnE
            E8xNDWHu2Z/3mPFhOIUW5wH/d08cg0nd90E4s1Uv/dI0yJ6E0PFH4p39qWKLCK76
            rnrMTlt/cDf538hAqtfsAQKBgQCV7iZw/VVeuKZHEohgaCzX1Z5GCmssdwpliPGV
            Miof4Qd3vWJfjFPnsOCRQ76VBKhQHG9PcrVg1IdSCpHYyo6E7INJAlNhQfmBkJC7
            r2q7/GbmWYvZ8ZiGvekmQ1R+R1nZbztWCGzJQBVTOJTNQpC55cXt2IRZzzRhPCgu
            CxLpsQKBgQC5ePcDvRiOpswPMT1Vx1s9uigGmgfO9FqvmM4PUcXij3cD1ehhk+lE
            D/zcwudwEV090g09KvarXrC1CoQnm8VaI9G4Bv2MPccE5MckTiMjwufbMPUfY9ax
            iKCpLSc1ZKy8vms6H1zkgg1YdyHwbs7gCxnah/16bptfct4ZcF2uHg==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-controller-manager.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID7zCCAtegAwIBAgIRAMO0v3B17wbkPNs3BIyXfO4wDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDQwMzEzNDVaFw0yMTExMDQwMzEzNDVaMIGgMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxJzAlBgNVBAoTHnN5
            c3RlbTprdWJlLWNvbnRyb2xsZXItbWFuYWdlcjEgMB4GA1UECxMXS3ViZXJuZXRl
            cyBUaGUgSGFyZCBXYXkxJzAlBgNVBAMTHnN5c3RlbTprdWJlLWNvbnRyb2xsZXIt
            bWFuYWdlcjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAJyToum+hC/s
            3LrOUaqT2SzUGd+oKGWmkp+mT0+AWloexdW3vvi6XGKMVZUpw5xC4PMmhsBrAtc4
            d0GQvBKaauzpaQg6PG/L0R951zbwgwsN0I2HtQ6ZzKZJ/Pphpkk83UdBef4/7fv/
            LuB0arFJZBQeo4hPcYUqdKNlpx1QAlEb4ZqHtrNvWys6jNkgQt7sY7wuDB8Ll7Fc
            wicfLRmY7lYNZzMDRgoXrlbkk2Aq2QXcgG/xFmhblI79iJzqzZVpxnN6K4UVpX8O
            VfamiE2ZfgKakTVRl+ArJG+d5/Q+PPawEDOHu20PgY+FV9A7fKVZlnLx0SRxhhgC
            UWUWkYoCuzkCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsG
            AQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFBd8t1GS
            NHmBvG3UlZ6Hk4jID4nnMA0GCSqGSIb3DQEBCwUAA4IBAQBjKY8q0gGXVCakzKO9
            4DkCI9a/b8DRu/EmTFWTG/wpDuT/QlNp7cZjSQ0mwIcAU5YNYgYp9p734y9pmIDN
            cKGVtRGHK4qT9iE8666lUlbVMddRx8XKv2CMr6NHVO2xCmcvl+rKk7/Ur3tqcpa7
            K7iJO4qtKKANxLR3bbuK2dZkIgAVXi461gZ6bFGhqVFwB6PHQXNPzTKjUXHJWue7
            PDXvmsyKFJnxtcWHl9pUSLDxH/QsB7GPoIQnYJOppBM+wXrLVP/yOp2yh4KT2kxj
            PpwL2YjPQBjW5GR8POp1++zXzDm7FwwkZB9w+6xGK+7ktOYlzquvTBEIBKZvMBRg
            fuOv
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-controller-manager-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAnJOi6b6EL+zcus5RqpPZLNQZ36goZaaSn6ZPT4BaWh7F1be+
            +LpcYoxVlSnDnELg8yaGwGsC1zh3QZC8Eppq7OlpCDo8b8vRH3nXNvCDCw3QjYe1
            DpnMpkn8+mGmSTzdR0F5/j/t+/8u4HRqsUlkFB6jiE9xhSp0o2WnHVACURvhmoe2
            s29bKzqM2SBC3uxjvC4MHwuXsVzCJx8tGZjuVg1nMwNGCheuVuSTYCrZBdyAb/EW
            aFuUjv2InOrNlWnGc3orhRWlfw5V9qaITZl+ApqRNVGX4Cskb53n9D489rAQM4e7
            bQ+Bj4VX0Dt8pVmWcvHRJHGGGAJRZRaRigK7OQIDAQABAoIBAQCCG4QSa4d4M4Cv
            keX2smiSgaUGXrtCzImmNBJPY76wiEWoc8ky8dj24tny2wN6g3BdXDQ5DDMOGBOw
            3c4KP1p+hu4KMioqU9jwKNSXCIA73TzhflULTu3peC3I+P+ud+7/2P7AMOtWrROM
            2/AUZYHN3i/RgwI3v7GwXTXie6uRLScpLDuNVDasNMqx2dnDvfVQk5xiBr++pMkF
            KnCbvrvSjGz31V56SaIX1IL/zBztv+suf67yoZ2xLuSi6r0gmzCJB4+fEoVzt7Hy
            TgTjCGt5g/0R8DTeb6Y/M628ciUVGTtlgyh49SQrcmojT88lbJv54hSEEz2MFx4l
            4lBOUUmpAoGBAMoqCoWkRBSpFJb77xL5kQ0K9KEOej3r/V/CGmKNFol8aXoyWgep
            9+0YMa+7b759nJgUFeBx7DVeInO24SLS+aBsimOm7G0nigVPCF9gcac4nW+SqWDD
            uU6zRpiXzzizehV4MWdFldil7G9FKojScziSOM6DxLWjIKpkk1eeJwOLAoGBAMZF
            zG99JtZ5q6FPp+Bgvx1F+WqDAB0YUliBE3foHRUztTVd1xXHxxg7ewUrK6hqH1q9
            Cbuzb4LngCrrGU1KXfEAEEK8duniGj8GyEr5fAxLbNJBv1IqkrM/Ab2Hs3aqnn8J
            +uzRshChNeaNJO3R2RgiJi5wY4xc52VMRQhopkTLAoGBALhGnhS3aP9UJ9qAhqnL
            Jva2l8n/AlpTNEAHFDnk1Tg5WYPzRbFasw1BUnkW54LByO2u0UonTeJPjiPf/VPa
            74PVrEetrjDJK7wvEDiwFqkQqCE9lHsJrW4ZaC5Loq3Sm2PajV3PRgmXJO9AIsdY
            3YIhdvp3jeTrbykiSFRDatiFAoGBALqS18tZs4BDQfQrpseHgo+jVw6ZczPtvR83
            ZwCAVU2sOKqdQVZnhbwRzLOSaiSyqAqUtGICeb5u5bZ9QHPwtPGho6uI+UUg1J3W
            XgffOJHBMAeygrxo/17YvWSCG6hg6YCV/Z93u93WNYhb7RI1U9pX2CH+9E4S5lP2
            L0e4Yi19AoGAKoxkZg9BKEfhHH2zfPZDfoGZIOrpq7aHtJO0kfJPn5YzBg59OpUq
            I37nOuOB2L1zADRtVVTqYyLvEuceXsUxAT9cH7bc403LAsGO50f2YJxdLmJjohdR
            H7kscils17sD4XYR4GSWczM4h9r4ZoWVmYbkETFk0+rMsWLsHW5hCzM=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-scheduler.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID3TCCAsWgAwIBAgIRANsQyvr+f47GBxWbwkKie4QwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDQwMzEzNDVaFw0yMTExMDQwMzEzNDVaMIGOMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxHjAcBgNVBAoTFXN5
            c3RlbTprdWJlLXNjaGVkdWxlcjEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFy
            ZCBXYXkxHjAcBgNVBAMTFXN5c3RlbTprdWJlLXNjaGVkdWxlcjCCASIwDQYJKoZI
            hvcNAQEBBQADggEPADCCAQoCggEBAOE62UqYa9SMeyUH8ltLMkC8eAJrIwcYM64b
            ZpyuFv5TbIL5YyeYw4UTFoH/O8EsFSyJUIXTnmu0DcvrAUitnmqeeY+vgh2tqrLK
            XcrtDTc1sMap9Y/iI4Il4saQvZioRP/U4O6lZgQAa4oPWM6R+sPJfC/8bibH6z9E
            Wc9089wtELGJRJZq5zm4t4adQZEorcPOqca6MMyN80IITxwZl5FefjfKLDkaM7Qq
            nf/tV8lDzJ9KdFlMGuaJbcSEbOZWeyulVju3WW9WuZhHOHQeyjFQrXD0up90t+5w
            M5SF3Xj1HRtcgLkh3XJDPh8jz22zuYRoHovxxAYNiavTl2SH5SECAwEAAaNgMF4w
            DgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAM
            BgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFBd8t1GSNHmBvG3UlZ6Hk4jID4nnMA0G
            CSqGSIb3DQEBCwUAA4IBAQA6mFj8JdD94al/GvQ4gSOpfRptnbY+2nYXRnQwJWzn
            5G3fUqLe8qX8kqwk489SHjvEvGSzLvoUs0XKsayGQDQJ0qQXWWrcMi6Nfte5eQIu
            y03YNevizB5fE2NrSzeIE6dyQg6VWsG1N323YBx0TRqoENVRGujAwjLPj/5OqbmB
            VyU+pXpVuu4xKdRKrnLCjaOFuIIg9FgBTAvtb3KJIqRshBFci1OfoNGmm94n7Ely
            1oeCIuJEODRO0fb4tBR5+EmJstQaMSI6OitawONEQwKEX8+mmeCczOhVHkpBMY6e
            BBxkY6KDjZO1KD3z1kAJTbe7RUM1+nxdLPkGKndKFElZ
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-scheduler-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEogIBAAKCAQEA4TrZSphr1Ix7JQfyW0syQLx4AmsjBxgzrhtmnK4W/lNsgvlj
            J5jDhRMWgf87wSwVLIlQhdOea7QNy+sBSK2eap55j6+CHa2qsspdyu0NNzWwxqn1
            j+IjgiXixpC9mKhE/9Tg7qVmBABrig9YzpH6w8l8L/xuJsfrP0RZz3Tz3C0QsYlE
            lmrnObi3hp1BkSitw86pxrowzI3zQghPHBmXkV5+N8osORoztCqd/+1XyUPMn0p0
            WUwa5oltxIRs5lZ7K6VWO7dZb1a5mEc4dB7KMVCtcPS6n3S37nAzlIXdePUdG1yA
            uSHdckM+HyPPbbO5hGgei/HEBg2Jq9OXZIflIQIDAQABAoIBAB3iqSJ0xxoU6eIo
            A8iJWcmtOF9Zx/QRCgp4KE1x7Csi9qsKXFXMt2TY+4uUSmF/b+/Q6JZZVhQEeDAu
            pqT2JKcRECA4sZMukA/ZOkjK244P2b0CoErPPtbuIAEpA39WFJG9tXr1B2xQgfR3
            xNjkFdoUyh2z6QnMTTK/5wrYAeOc93h5nP+Ij5ROVb49j368wWjbOZM7UEDlTOoE
            sX8/yb48oJfZowGHR3n3T9AcyiwhYv2LKAfalHnx4Rr8nLxSyImRYwaTsB4ztQ9m
            yU/SAuyJjIxfTt86Ibj1CCS5wHE0kKK+AxgcZ78UERaLmK8LZ2G5MfRVJ/FlJDUn
            3qpqteECgYEA8Y4NG/amppwd9oN0tzxzFm2+NF8JJa1fWRqFnMcOPjweUweSI/C+
            bTHtXyjpAGjTdSl57eGV1uV+VfF9gIaeSAg3RqTzvRfYr/1EINkmb8rZsNG7PqeO
            hR4YvQszCPKqJBXn/2akZbYqZ0uK5K5P5Ksiy+MkRb9kQfEV6Lrgkv8CgYEA7rLh
            CBcBvy1TzhD0y3DYcUD3qI5oKwb/F+/h+ZNqs5d6I4UsLDj7qFOk0VgtQL2Yo8wQ
            5By6YJpovInZtqZjCY94/qIbQlIy0Ejw79hXLt+e/dxYAU96xxg1hGE7IIHoAQyP
            asS6O9AAz+t7Q+2qS6FwE9nQqh+m/uOZiWJ9J98CgYBlI0T54FwGhndFL+U+k2Dc
            kzaAVwpNbDnv5NrsuauNAz7vJMxboAEbVzw8C7UDJuDivWr/3uQOBijPcz1JAxRi
            tI3wVkB3e/SOO0y7NDCTvitHjYkIwr85nVBeVsIXjQMP+NwaY6+RpqQ6e7a76QAq
            jj0TgRc+3NPtiDPULeq5oQKBgAIn+4BnNMzVS/yAirWLv2jGfXY4UxiQZ51/vTrT
            6hLVO3U2rr93hE5w8vwxH7eF/ur73OsylzxoKKoLVLwhpKNheGZUcIqY03yuK/7+
            pUr3GiiQ5PqeDS3fOhyIBFC227Gmu2TrggMoTdmS9voWG4OzYZ/MR+ZBgvCqfaiQ
            CzFhAoGAcCoVuLAU633ddU5+z1NkAPij3eg90q2VndgEEzkjJDC0Kb+lmpfzAUAn
            zhQibHbDQgDVcTDwRtSAU0opz65KPuxb2Py3UAdfqKKE+7aX5UwzFxBW7x+Vm0Kv
            f4QQ5jRLQr6Qc7VQqJBF9aaHsU2bT2fQNxsSdRYK9yG1/IE8PR0=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/admin.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDxDCCAqygAwIBAgIQC6jlEgSumeaNxsKfx0b8ETANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwNDAzMTM0NVoXDTIxMTEwNDAzMTM0NVowdzELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRcwFQYDVQQKEw5zeXN0
            ZW06bWFzdGVyczEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFyZCBXYXkxDjAM
            BgNVBAMTBWFkbWluMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA06QH
            HkT21JoCP5zrTCA6pFxzMAQKE/qxTrp48G5wzgNbXR/0OM4lCyhoXFPsQ5XHnDC7
            CPi5nBKwA+S7sxrTWVDmc83CbVAdsjaxhWYvpqN+pw6zs9pS5mfI2m4R0Ja0pbBK
            f4MMPIriQt/90kZ3SvazsV5bleyFq3mWdv+vpb+tfWdjp5Kf5cIEokiiDmPiz0/5
            aw21fdLL1LEnD/iwriPhg9ljpASDmJXCUw8VtEqq3GwpjEfWVA8+Q9WZOc4TC/8D
            bFwvVSicLmvcXv+4gmzuOTcYq/0cJNwqwI+1U2FTRmiT5J8njG3OKclzvKVu9HXq
            zrkFwT4vA6TyS/HJiwIDAQABo2AwXjAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYw
            FAYIKwYBBQUHAwEGCCsGAQUFBwMCMAwGA1UdEwEB/wQCMAAwHwYDVR0jBBgwFoAU
            F3y3UZI0eYG8bdSVnoeTiMgPiecwDQYJKoZIhvcNAQELBQADggEBAI1HnuJ+JSjf
            Ihz8aplwUPEt1P0Xl0DS9wDJJL8WFxZgalltUlS+P0flLRZIM7VHf3RUrYDpWL3P
            4jjmwTzP7ZrrquH8/2UMWmDTej+32/TIh/lWZ/uDkH4T5p8I2dEYmkvt+Khr9WoB
            PVKZ3NdK+S8hE9uUDAjHxcPey8qFBckAkG3dDmfqhVxh6g9+t9kz0CVkhZqCtwbf
            ldU6xvZ47BWup34OcReSOADPT0mK/B5Tox5L8RcQA+uVrBT4byB/VYYkhY6FLIW9
            a3cVTpbEmdvO6EynasxtI0AQ5dz2hkoduA3wT0IP8lmC0igufYbuw4mBLaf/n7Ci
            Wiiv69yy+zs=
            -----END CERTIFICATE-----
            EOF
            cat > ~/admin-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEA06QHHkT21JoCP5zrTCA6pFxzMAQKE/qxTrp48G5wzgNbXR/0
            OM4lCyhoXFPsQ5XHnDC7CPi5nBKwA+S7sxrTWVDmc83CbVAdsjaxhWYvpqN+pw6z
            s9pS5mfI2m4R0Ja0pbBKf4MMPIriQt/90kZ3SvazsV5bleyFq3mWdv+vpb+tfWdj
            p5Kf5cIEokiiDmPiz0/5aw21fdLL1LEnD/iwriPhg9ljpASDmJXCUw8VtEqq3Gwp
            jEfWVA8+Q9WZOc4TC/8DbFwvVSicLmvcXv+4gmzuOTcYq/0cJNwqwI+1U2FTRmiT
            5J8njG3OKclzvKVu9HXqzrkFwT4vA6TyS/HJiwIDAQABAoIBADx48+e8QOMCln3i
            soDv/JGWMPuZS9/lk+Aw+/mHNQhIgUScqsXIcWE8zIUFHc857u08J1Uq7K4h0NVr
            +A33LkipCxAvzMw7RiDz68l4J0lwEfJeCw7q5SEcqpFvPfvh9AAb3U2N/mMWNAxz
            wCzjIZbz4uhdU8IE8TTL6yhZarDrDPc1OvkDQ37UM6rBGDX3IZ+i0/7V+YFr0603
            GufC2lzdt9mHKQ7iPpe3U2K3gavwWrI563gSjFCZtLKYC7fSEsMa3/WqVxeiitdG
            sWtEVe29YiB6WMIadY6nC4BwiAKOuS6KWNzYgp50v98D0lbNJHR5WQ8QoK4JKHO5
            /6FLR5ECgYEA5LERcB9VavI7jWSPr8c4DjSWZPyUxGEtJ1lHb9jDhTzWOGwVnqyv
            YRdcft5siqerSAhouyDUS/po4VYfnQxAgPEfrGiFHeHEfANG4rfaqQArWJ1UdLzP
            qglWhvaDVY+EsNlrqja/bOxLip/LDnYa4I8DdHVO/3+3b5zAVoPVKX8CgYEA7Om5
            sPOwR+zUp/psmGQ3kNBc84fKjVK17FJcyAvY3M/Sh/4MvH1X9Ug+qX5+OmYjjAYt
            S6soPHcmtuDnoh3Hm+6Oed5EwKgOYC2Hj0tctjy8Wa2Ko1OdORy+giOCguJdeNJg
            lNJbNhZXKlxPXPSF+Ra0sLDUahJBPQ1Xx8i6bfUCgYEAu5wXdif+ZxH5kPEif02r
            ytuRVZ9wW/pslI9Fb5ggLjnOc9MXmWiJJ9mGY/4MhWMvvJRJdtpjz0DKsbF5ldjr
            QdyN416Ldgw0qJf3mx7BH0uoQ7YuBuauZgvrFCU/cP2gGYUEMktflvfysPKOHnr9
            aaNpbiyedjRMRCAQGellAfkCgYBnR3TV+UYN9Oa32+nffUDj9pGu8LGSbk40mass
            4k1F5atn8Y5n1VS07yuyBBzPJJu2fTLd292MjnzoGJ+iAs1z4sllw0nBmwG5V9/S
            zg26vDt39LmNffP6Y9eBMC3DFR+efkfwWMu+hnq1UsyeP1LwRb+7jzrqis656Mkt
            pQnwyQKBgQCFEq2m+tKCC7gGAkmwrALfytvy0z9OKfjSfWwZyo0SbmcF2beon6rt
            tFoEDVqFT4gs2jPx+IQo+1cxliRiWmjFDBu7xZlOzW5k7P+TP+ufoYLEWLyQn3fG
            8UtYM671ETokV9HbOilbGomOS49JZ2wCPBfDLy3LeICu5EQFyqHxJw==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/apiserver_create_role.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRole
            metadata:
              annotations:
                rbac.authorization.kubernetes.io/autoupdate: "true"
              labels:
                kubernetes.io/bootstrapping: rbac-defaults
              name: system:kube-apiserver-to-kubelet
            rules:
              - apiGroups:
                  - ""
                resources:
                  - nodes/proxy
                  - nodes/stats
                  - nodes/log
                  - nodes/spec
                  - nodes/metrics
                verbs:
                  - "*"
            EOF
            cat > ~/apiserver_role_bind.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRoleBinding
            metadata:
              name: system:kube-apiserver
              namespace: ""
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: system:kube-apiserver-to-kubelet
            subjects:
              - apiGroup: rbac.authorization.k8s.io
                kind: User
                name: kubernetes
            EOF
            cd ~
            wget https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kubectl
            mv kubectl /usr/local/bin/
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-credentials system:kube-controller-manager --client-certificate=kube-controller-manager.pem --client-key=kube-controller-manager-key.pem --embed-certs=true --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-controller-manager --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config use-context default --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-credentials system:kube-scheduler --client-certificate=kube-scheduler.pem --client-key=kube-scheduler-key.pem --embed-certs=true --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-scheduler --kubeconfig=kube-scheduler.kubeconfig
            kubectl config use-context default --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=admin.kubeconfig
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem --embed-certs=true --kubeconfig=admin.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=admin --kubeconfig=admin.kubeconfig
            kubectl config use-context default --kubeconfig=admin.kubeconfig
            cat > encryption-config.yaml <<EOF
            kind: EncryptionConfig
            apiVersion: v1
            resources:
              - resources:
                  - secrets
                providers:
                  - aescbc:
                      keys:
                        - name: key1
                          secret: $(head -c 32 /dev/urandom | base64)
                  - identity: {}
            EOF
            wget -q --show-progress --https-only --timestamping https://github.com/etcd-io/etcd/releases/download/v3.4.10/etcd-v3.4.10-linux-amd64.tar.gz
            tar -xvf etcd-v3.4.10-linux-amd64.tar.gz
            mv etcd-v3.4.10-linux-amd64/etcd* /usr/local/bin/
            mkdir -p /etc/etcd /var/lib/etcd
            chmod 700 /var/lib/etcd
            cp ca.pem kubernetes-key.pem kubernetes.pem /etc/etcd/
            cat <<EOF | tee /etc/systemd/system/etcd.service
            Unit
            Description=etcd
            Documentation=https://github.com/coreos
            
            [Service]
            Type=notify
            ExecStart=/usr/local/bin/etcd \
              --name controller-0 \
              --cert-file=/etc/etcd/kubernetes.pem \
              --key-file=/etc/etcd/kubernetes-key.pem \
              --peer-cert-file=/etc/etcd/kubernetes.pem \
              --peer-key-file=/etc/etcd/kubernetes-key.pem \
              --trusted-ca-file=/etc/etcd/ca.pem \
              --peer-trusted-ca-file=/etc/etcd/ca.pem \
              --peer-client-cert-auth \
              --client-cert-auth \
              --initial-advertise-peer-urls https://10.240.0.10:2380 \
              --listen-peer-urls https://10.240.0.10:2380 \
              --listen-client-urls https://10.240.0.10:2379,https://127.0.0.1:2379 \
              --advertise-client-urls https://10.240.0.10:2379 \
              --initial-cluster-token etcd-cluster-0 \
          -   --initial-cluster controller-0=https://10.240.0.10:2380 \
          +   --initial-cluster controller-0=https://10.240.0.10:2380,controller-1=https://10.240.0.11:2380 \
              --initial-cluster-state new \
              --data-dir=/var/lib/etcd
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable etcd
            systemctl start etcd
            mkdir -p /etc/kubernetes/config
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-apiserver
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-controller-manager
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-scheduler
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kube-apiserver kube-controller-manager kube-scheduler kubectl
            mv kube-apiserver kube-controller-manager kube-scheduler kubectl /usr/local/bin/
            mkdir -p /var/lib/kubernetes/
            cp ca.pem /var/lib/kubernetes/
            mv ca-key.pem kubernetes-key.pem kubernetes.pem service-account-key.pem service-account.pem service-account-key.pem service-account.pem encryption-config.yaml /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-apiserver.service
            [Unit]
            Description=Kubernetes API Server
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-apiserver \
              --advertise-address=10.240.0.10 \
              --allow-privileged=true \
          -   --apiserver-count=1 \
          +   --apiserver-count=2 \
              --audit-log-maxage=30 \
              --audit-log-maxbackup=3 \
              --audit-log-maxsize=100 \
             --audit-log-path=/var/log/audit.log \
            --authorization-mode=Node,RBAC \
            --bind-address=0.0.0.0 \
            --client-ca-file=/var/lib/kubernetes/ca.pem \
            --enable-admission-plugins=NamespaceLifecycle,NodeRestriction,LimitRanger,ServiceAccount,DefaultStorageClass,ResourceQuota \
            --etcd-cafile=/var/lib/kubernetes/ca.pem \
            --etcd-certfile=/var/lib/kubernetes/kubernetes.pem \
            --etcd-keyfile=/var/lib/kubernetes/kubernetes-key.pem \
          - --etcd-servers=https://10.240.0.10:2379 \
          + --etcd-servers=https://10.240.0.10:2379,https://10.240.0.11:2379 \
            --event-ttl=1h \
            --encryption-provider-config=/var/lib/kubernetes/encryption-config.yaml \
            --kubelet-certificate-authority=/var/lib/kubernetes/ca.pem \
            --kubelet-client-certificate=/var/lib/kubernetes/kubernetes.pem \
            --kubelet-client-key=/var/lib/kubernetes/kubernetes-key.pem \
            --kubelet-https=true \
            --runtime-config='api/all=true' \
            --service-account-key-file=/var/lib/kubernetes/service-account.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --service-node-port-range=30000-32767 \
            --tls-cert-file=/var/lib/kubernetes/kubernetes.pem \
            --tls-private-key-file=/var/lib/kubernetes/kubernetes-key.pem \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-controller-manager.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-controller-manager.service
            [Unit]
            Description=Kubernetes Controller Manager
            Documentation=https://github.com/kubernetes/kubernetes
            [Service]
            ExecStart=/usr/local/bin/kube-controller-manager \
            --bind-address=0.0.0.0 \
            --cluster-cidr=10.200.0.0/16 \
            --cluster-name=kubernetes \
            --cluster-signing-cert-file=/var/lib/kubernetes/ca.pem \
            --cluster-signing-key-file=/var/lib/kubernetes/ca-key.pem \
            --kubeconfig=/var/lib/kubernetes/kube-controller-manager.kubeconfig \
            --leader-elect=true \
            --root-ca-file=/var/lib/kubernetes/ca.pem \
            --service-account-private-key-file=/var/lib/kubernetes/service-account-key.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --use-service-account-credentials=true \
            --v=2
            Restart=on-failure
            RestartSec=5
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-scheduler.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/kubernetes/config/kube-scheduler.yaml
            apiVersion: kubescheduler.config.k8s.io/v1alpha1
            kind: KubeSchedulerConfiguration
            clientConnection:
              kubeconfig: "/var/lib/kubernetes/kube-scheduler.kubeconfig"
            leaderElection:
              leaderElect: true
            EOF
            cat <<EOF | tee /etc/systemd/system/kube-scheduler.service
            [Unit]
            Description=Kubernetes Scheduler
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-scheduler \
            --config=/etc/kubernetes/config/kube-scheduler.yaml \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable kube-apiserver kube-controller-manager kube-scheduler
            systemctl start kube-apiserver kube-controller-manager kube-scheduler
            apt-get update
            apt-get install -y nginx
            cat > kubernetes.default.svc.cluster.local <<EOF
            server {
            listen      80;
            server_name kubernetes.default.svc.cluster.local;
            location /healthz {
            proxy_pass                    https://127.0.0.1:6443/healthz;
            proxy_ssl_trusted_certificate /var/lib/kubernetes/ca.pem;
             }
            }
            EOF
            mv kubernetes.default.svc.cluster.local /etc/nginx/sites-available/kubernetes.default.svc.cluster.local
            ln /etc/nginx/sites-available/kubernetes.default.svc.cluster.local /etc/nginx/sites-enabled/
            systemctl restart nginx
            systemctl restart nginx
            if [ 0 = 0 ]; then
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_create_role.yaml
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_role_bind.yaml
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://34.87.208.7:6443
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem
            kubectl config set-context kubernetes-the-hard-way --cluster=kubernetes-the-hard-way --user=admin
            kubectl config use-context kubernetes-the-hard-way
            echo start sleep > sleep
            sleep 2m
            kubectl apply -f https://storage.googleapis.com/kubernetes-the-hard-way/coredns-1.7.0.yaml
            kubectl create secret generic kubernetes-the-hard-way --from-literal="mykey=mydata"
            rm sleep
            fi
            echo finished! > finished
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "controller-0"
      ~ project                 = "kube-293902" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/instances/controller-0" -> (known after apply)
        tags                    = [
            "controller",
            "kubernetes-the-hard-way",
        ]
      ~ tags_fingerprint        = "VcbEPNUNsEE=" -> (known after apply)
        zone                    = "australia-southeast1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/disks/controller-0" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20201028" -> "ubuntu-os-cloud/ubuntu-2004-lts"
              ~ labels = {} -> (known after apply)
                size   = 200
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kube-293902/global/networks/kubernetes-the-hard-way" -> (known after apply)
            network_ip         = "10.240.0.10"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes"
          ~ subnetwork_project = "kube-293902" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "35.201.15.17" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      ~ service_account {
          ~ email  = "848896957875-compute@developer.gserviceaccount.com" -> (known after apply)
            scopes = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
            ]
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # google_compute_instance.controller[1] will be created
  + resource "google_compute_instance" "controller" {
      + can_ip_forward          = true
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            cat > ~/ca.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDsjCCApqgAwIBAgIRAJ5gOUr7UsggwdD138AKwuIwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDQwMzEzNDVaFw0yMTExMDQwMzEzNDVaMGMxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczELMAkGA1UECxMCQ0ExEzARBgNVBAMTCkt1YmVybmV0ZXMwggEiMA0G
            CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC+sLEkZL9XE2LfOPv+Ln6SIRrLbFWQ
            UgViE2T7Ac5qrq7lpu9Fu9SJHzvMOgD5TC9x2kCXeODddJyA5ev4OvsfI95Nq3Lw
            go9udNZD9f0pM3dQjRQHD5/SNVdkl4gRmaV/nddpBPZ74VhDZIjSHFkYvthYvyu+
            rpzMtb9g3bWkXr2yTV3IxvpRe5VdND+ofMOvvqaIPQZZ33MdgcrzrzkvjfvFHTby
            91l4Dv478g/pQGpgcIL69z8GfuJJlh5A6bm27batckDmKkZBh26Ntvf/O+R5xKgB
            qvMY40mbPXeOMupJoBUel0EZq9pjsmHAeAGbQCwLNyb27+jlqNdDzRWDAgMBAAGj
            YTBfMA4GA1UdDwEB/wQEAwICJDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUH
            AwIwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQUF3y3UZI0eYG8bdSVnoeTiMgP
            iecwDQYJKoZIhvcNAQELBQADggEBAExDl0D2TwVKByAeOpja5S2MYtIcHs9iTHXI
            fLXS0W18ki7UAV5IR49HO0t4AyUlQ3oqT/qs14K1HjwrSRVsjUBl1NgkNCOtlNNX
            P48fpqrCdzZJuyJcx6cmU9gpVi+Ft0NoBXXVW6QK78L9psobYzJ5r+bTnikqUOPc
            Mkmui5yiFIHsZ8LNjyDFRk8cMIxxRa4eiELZof8Vrq+oicM80ALw8t2yiLAIbnik
            jHT8Se7AHD6A/JrQsEDJqgpz4l6/orm50mfXp5ckivseZNH4ZFCIi3FHukvYx7Lp
            G8v+Gh8DgXLxYPJ6kJpBGFgaJ75uu/GLMKKupSbzu1FnZcKaIKs=
            -----END CERTIFICATE-----
            EOF
            cat > ~/ca-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEogIBAAKCAQEAvrCxJGS/VxNi3zj7/i5+kiEay2xVkFIFYhNk+wHOaq6u5abv
            RbvUiR87zDoA+UwvcdpAl3jg3XScgOXr+Dr7HyPeTaty8IKPbnTWQ/X9KTN3UI0U
            Bw+f0jVXZJeIEZmlf53XaQT2e+FYQ2SI0hxZGL7YWL8rvq6czLW/YN21pF69sk1d
            yMb6UXuVXTQ/qHzDr76miD0GWd9zHYHK8685L437xR028vdZeA7+O/IP6UBqYHCC
            +vc/Bn7iSZYeQOm5tu22rXJA5ipGQYdujbb3/zvkecSoAarzGONJmz13jjLqSaAV
            HpdBGavaY7JhwHgBm0AsCzcm9u/o5ajXQ80VgwIDAQABAoIBAHa7QbDtYg3vrjJb
            ItwjSv/lyO88ZxJTX7KvbMK1XzchyRiJFpaO20j9v5frzctr2mbDhFBMHYcGIqRH
            hOOspcu/45zs0cZbJL+b1AXA1n6e4v2uufejjNmwCNhDWZ/L0TZiq0tioa6EoxZj
            NKXOrNMxkTfA4JX71vnHeH/xzDWpCp6X9WsNKPFe96xmvemI6ez+x9fcethIROgE
            Tvz+rgiCQ/j7oLJoM/MdRvWnPJCdHhHSibIZ7k13fRr0GT+QO7tgnlhOBU0HTj8L
            rHGIFZb2ZtquQ0WqOiN05vbrtRrHZnm99Z85a4tHJkauF25sqOMEi8FRKdsfWPDQ
            UONgX1ECgYEAwwZneucj4fc+PdIY7nUqO599SY6UxINIVkY/0/mp0an8lk5MPTi3
            /Zpdc5PCWBGu9QLyujCUX6KPb5q0/mFN4VHCI13zgEYmVRv10gnsnh6AbzsWYo14
            cOqStnJOSWmrZDwqSSWJ+6cKFCQyuPMdV2SnZSLotBFKWjJ91O7jqfcCgYEA+k9V
            d9w2jK/DAB5eyz6/aB50TKjtPLOgelpn2dV8XsgNtfJIc6K6e2a9FaYTxjJsnZxS
            43lyXagHuSH6yD8CGL1TECljFqEdoW6ugr92I9SjB6A9ld6DPP9ulcVUovQulNap
            9ZjSLot4koErFAO4cmFfqEsPOpIs5A6qqnpx7dUCgYBlJoIvTYjf30Np/vktXJl9
            +RebOhdQ4SJ4lNDwGZKJixfVwWBrdGqBXznPAzkOQoWy0EeiaCXcgEzSvrPXKBKj
            pasCeu0bf8bL58eUm88cp4dHqabPkL6CGjfj5t9R1jutrkLkU1MAsb9ZePjR0k5K
            kIr9uqBlHH6qz3tSIGD2OwKBgCPOe3x07Py9G9kFfyv14u2jBaH9vEolq/w0uIxp
            xKvOVF/Fs+WOzrxeWwggxM1iYzU8qoLN2bVaFxi9qqFAmi0t0BcMxJb1H0b7jU04
            1E6V2Wh63LR2qzFrnMch/lR9N7ik6JUwckikPPBAOAhZ6+W41jU934TSakeJbZKL
            h4atAoGAG2C/P98/ayvNelW+qflB2YmZQGvi81iuwkCL+oXcqCcm7h+B3j5BfDsw
            HTCXC99xL9jCG2DW478F16XSi9fb1P5v8YowZCUlZzdrh8+PmhikP0nwmzN5Xbqe
            gYGL8dpCqylFWN692DHUIl1vGKtaNlGyfb4PmfJOQU29CyuppFc=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kubernetes.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIEcTCCA1mgAwIBAgIQEY6wABS+cCHhjGN/eXO2yzANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwNDAzMTM0NloXDTIxMTEwNDAzMTM0NloweDELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMwEQYDVQQKEwpLdWJl
            cm5ldGVzMSAwHgYDVQQLExdLdWJlcm5ldGVzIFRoZSBIYXJkIFdheTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAL/9
            Ezavbd+Zf8AVDIo1golZ2nC1lPl6y9Tzb2uDXClWZg5KTjRRzfshML3PJ0Xuarou
            vMGG380DL1B5ujM2ZyRq9xhHsAPVuWFSxlJJedTndzNxHT6OvrDgompIfME4GRl+
            QcaDP4rYwwArIU/H+5uDKjIQigDBOJrhDvA0ZAub+6ClQLMVJY/Q6uXZBRw1XqiE
            mESTW2Go3tdjblzwgmE/WCtXXqLmfJri8Vte9CLHfw287pn7YRw/8uYPtLWfmdAj
            2NwHzqQOEXWiVDbVq37QlJo4kqjSSOJinVBg1ZK9ByEofDjSh8Qs288xxuM7hQoF
            meQn/eRm7RnLPIm9IeECAwEAAaOCAQowggEGMA4GA1UdDwEB/wQEAwIFoDAdBgNV
            HSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAfBgNVHSME
            GDAWgBQXfLdRkjR5gbxt1JWeh5OIyA+J5zCBpQYDVR0RBIGdMIGaggprdWJlcm5l
            dGVzghJrdWJlcm5ldGVzLmRlZmF1bHSCFmt1YmVybmV0ZXMuZGVmYXVsdC5zdmOC
            Hmt1YmVybmV0ZXMuZGVmYXVsdC5zdmMuY2x1c3RlcoIca3ViZXJuZXRlcy5zdmMu
            Y2x1c3Rlci5sb2NhbIcECiAAAYcEfwAAAYcEIlfQB4cECvAACocECvAAC4cECvAA
            DDANBgkqhkiG9w0BAQsFAAOCAQEAHaf2FuKk/1GVyFlk0hpBNd72TL+aOw+LjXF4
            0bpBOl43RlPeX44M7uyF+USpTHadgzn0EkcXWd8b6TTR78bX8Uu22Sy471w+R/Qo
            W3yBhf+3oiqSOSY1jMqubHOV5M9Yvg9iOt6mVGkccj3vd0oSGRcRQPjUoY2vqXL7
            InjJLsBpYoHBQpWA9kqGtcvZ104uzPcLYzODzeCYVm8YyVATO07+kBP8LCQiPV0j
            n0o2Oy4EcitmY2m7eDLoPwIpJna+1L3qnG65mLpPdCQPaugoE8fRGN5Ov1DGcSzO
            19f0KafIJxQKec2yFJjo4shyptwTIHfJyUv7XYNwSUv26CzSuA==
            -----END CERTIFICATE-----
            EOF
            cat > ~/kubernetes-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpgIBAAKCAQEAv/0TNq9t35l/wBUMijWCiVnacLWU+XrL1PNva4NcKVZmDkpO
            NFHN+yEwvc8nRe5qui68wYbfzQMvUHm6MzZnJGr3GEewA9W5YVLGUkl51Od3M3Ed
            Po6+sOCiakh8wTgZGX5BxoM/itjDACshT8f7m4MqMhCKAME4muEO8DRkC5v7oKVA
            sxUlj9Dq5dkFHDVeqISYRJNbYaje12NuXPCCYT9YK1deouZ8muLxW170Isd/Dbzu
            mfthHD/y5g+0tZ+Z0CPY3AfOpA4RdaJUNtWrftCUmjiSqNJI4mKdUGDVkr0HISh8
            ONKHxCzbzzHG4zuFCgWZ5Cf95GbtGcs8ib0h4QIDAQABAoIBAQCnRcxTvQ0x3/+a
            T7yZPn35Rbw4rzyZERA+/cp6Ff1aVticYsk4dH3O6+AXwEErgMqkZMw4oVakvL2g
            lC5TKHc9F6UqFmuZK8FUtlXso+/uO61zuH4OXzhty4o2p+lqP4I+3+5XE0ttoeZk
            Yy+m30qs997vt9FFTxQOfUASsNLp+P230Rr+9tTQyviL2ZK5tAcC8rLzDVt9wIqZ
            Shm1CrcCK8DH8jBmH017zxVGAf8myhwBhnh78OLHOBCLdnt5GWQ2bee4aUnm6j/C
            jdOJ9QYRZ67lVR6NDawtxFVoTlgyJGsr4dMIIHSe2MFXlXFLfMyZ3vKUcPWO2S4H
            FzldEWZBAoGBAPIT79PRNXwJR0oLJzMek7r7oLAfuoxrKdzBp16BGJL9XUjQepCo
            Dz13vYy+h7THcHvqYePezqr8KY7u6bRJEuc++t8ThXTwm+fE2I/BwbGLdpyZcxE6
            IXGVQC2nZW1z3QM2O5TVLuVNcnKivIgNaE4zDqYLdCyf752KGc/Wjfb1AoGBAMsH
            rwKuHAuNLIegkBNu4wDqe+b4bKPxzCNqO+DOI/Rs7VOuxxqEtuoVOie0rXmsP/25
            TdV51kKPzNQa+9zhvaZkGguicysXTHkBsl9wbkVr7Zh3i3AG9nQBnU1L9l174AuX
            gzDoWVnWIMGVhIC8jCTANYnKcofd39vfFC6c7zO9AoGBANiRm4JtbSL9jgig973V
            AidLDFPk3tjW2onDuj9i0SBXiQgmczBNGe1M3Yg3wGKr9mb1pgPdhhkUJP3Zob0H
            juDQyFGgPkoDJAdyZKgfmHCFK2UoJvhngBoEg3kUhDoqaLSB5UXefujno5cJHg+9
            pu4m4VkNcC6oGw9eyH7XHQStAoGBAIwGJZZ0nBT/bXmwrA0rCdZk4cUfClZbeg3m
            w5s8sKFvypJPVTQd2cVBlJUzz/y9ZnjHpz2WxMWtRXf3kEL7UYADQ89IX6OVcwF1
            wR5/fR3V3MytjfZaZvkE8AcSX7yDpbZ47Vr6tDz4KCk6xGLBJuplwcbhX/ICfNS4
            WsP3KiYFAoGBANBjyH0YgKf0kn6mUm9AL2jk1Qej51UC7MJ4aDAcJsj3lv6Gc026
            MIN6CopBCaANGlzMN4+r4ZbcwUWRa8WgYSwFX6t5wCiMb1nrr2p3MGqco0SAJASV
            Zqpk57sIIKTAkEo09UgwoKnYuWPTOtD/QQNJMe189he5HyFywTCbYWc8
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/service-account.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDyjCCArKgAwIBAgIQZSA+HLbgDmQrxe02qIEXGzANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwNDAzMTM0NVoXDTIxMTEwNDAzMTM0NVowfTELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMwEQYDVQQKEwpLdWJl
            cm5ldGVzMSAwHgYDVQQLExdLdWJlcm5ldGVzIFRoZSBIYXJkIFdheTEYMBYGA1UE
            AxMPc2VydmljZS1hY2NvdW50MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKC
            AQEA3ED+w8yCFxX4Afd4nNDKz1y3xt9f4ht47L+Ajd865+9ZZ77KFXFwYQX7hKk3
            9B1lfgeCCQ+QavaxeY4dGRJUSMKJshfr8F58RHqGOl2x50bC/SiveY1dPlG20fg/
            NnKGkC+SXU8hfyBct6czDjLMiMF+k3Jdxx0nYDE8VuxPUBrQa827pemYFaEgoJ7v
            inGmCZNDlkvdY685F6g91sjicTqMlF01qLqfmTTXMw7xzfRg+ybNaFbeOAnkxgQh
            jU88Ta4bUKymxq3fnHC+gywm7AsDuWbFS5aCE/gWxQMhQehJUSbLV1At0r82pkoL
            kDKlHepJ6vN306HC2zRv2JtVLwIDAQABo2AwXjAOBgNVHQ8BAf8EBAMCBaAwHQYD
            VR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMAwGA1UdEwEB/wQCMAAwHwYDVR0j
            BBgwFoAUF3y3UZI0eYG8bdSVnoeTiMgPiecwDQYJKoZIhvcNAQELBQADggEBAH5z
            qTGqmpjAEAF7zPLi/qk/r502r1HOY267cNgHU7vvLSvWhHNrHSXEQuQ8rRGAooOT
            YJkkwouSXxvboiyHx0yTxXKK1Y4g8FObCZyLqb4mosxBg8MWZPjBXCmQblwiFVL/
            b0IH+YL9H99fkaEKxxYy4gLFYDn4vsFPiqmY6ho3b0kS6HHdejpg06965E9+BFfp
            lxFwQ6tHbBU7lVCSNyqbAeBzzoPu4zh+vTJtOhChJgSXs7seNEdLlE0klLbx+4lm
            1VqJnuFAM8kfSElC/QIKBUUdBIyd1WUETNgG3hAu5cKjyfwnulY+pLF+phSiJeyy
            HHLTN3t/o/TbpaCh54E=
            -----END CERTIFICATE-----
            EOF
            cat > ~/service-account-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEA3ED+w8yCFxX4Afd4nNDKz1y3xt9f4ht47L+Ajd865+9ZZ77K
            FXFwYQX7hKk39B1lfgeCCQ+QavaxeY4dGRJUSMKJshfr8F58RHqGOl2x50bC/Siv
            eY1dPlG20fg/NnKGkC+SXU8hfyBct6czDjLMiMF+k3Jdxx0nYDE8VuxPUBrQa827
            pemYFaEgoJ7vinGmCZNDlkvdY685F6g91sjicTqMlF01qLqfmTTXMw7xzfRg+ybN
            aFbeOAnkxgQhjU88Ta4bUKymxq3fnHC+gywm7AsDuWbFS5aCE/gWxQMhQehJUSbL
            V1At0r82pkoLkDKlHepJ6vN306HC2zRv2JtVLwIDAQABAoIBAGERl/YM5GxuNy4O
            ta5O6oL29tuDyIsq1mFoiKx97EUZnEp3sDJBG2j3LQErXsiMSBWCE5IQtPIfJNpQ
            goxxIooqimrd1hLKYXQAl7WTY3ttGTRfQO6OGcEEXFEvWhSR5rIW9SeAX1/akGI0
            IvEn/DJtLG6pIaFGPPtM163rWY0QYusOItB3wMzf9FXXCyhIMMonxGMseYI6Fsk/
            v0DJkzp0b0Xh9NuHGdbkOM1hspDR3n0i0pS+BW4CPbk75IRQwspSjY6AUOHj01BU
            W+jE7XvEpYxvppPJD5pALd4vnowMVmoFln6F8ULM169e6GEmSDGg72lyMCGBHDRV
            njnBGckCgYEA7P6Dg2gHrUgHpF7yELlmLlZ5S2fg/hgC5PutqjuftLi1FQ3ZW69w
            0WtNV+iIiDlsXELWFUOKZfE/MPTLS5WqrGW9xmftcffqX35bAv4qPpQQdmEKjwdQ
            Fu/xI8D986S6eMXzPtGUDyK0l2JM4xZt9GPR6cv8afrQuI3dvxQKxlsCgYEA7erN
            oz5Y4zOgsH10hq956cAE7pLwGZnwp+1MufrJ/HL9zE80qyvIfGW1FdIhOpvW+Gro
            sVcudiGfMdK/+jm3cvCappol269WOzirQUi2KMGcZN2TE3KW2ZWId+IEIDTpXiZ1
            53og/JVzVpfW+h6uxvBz9cZxBr3DdI+RLwFR7L0CgYAM9d47UXUaBNZmJssWHw13
            e0Mm3IdxXd7KpvjYVmpld7RvclJwsSd6TGPuaskMqhdC9GTAxPDMomTSSJDVkVnE
            E8xNDWHu2Z/3mPFhOIUW5wH/d08cg0nd90E4s1Uv/dI0yJ6E0PFH4p39qWKLCK76
            rnrMTlt/cDf538hAqtfsAQKBgQCV7iZw/VVeuKZHEohgaCzX1Z5GCmssdwpliPGV
            Miof4Qd3vWJfjFPnsOCRQ76VBKhQHG9PcrVg1IdSCpHYyo6E7INJAlNhQfmBkJC7
            r2q7/GbmWYvZ8ZiGvekmQ1R+R1nZbztWCGzJQBVTOJTNQpC55cXt2IRZzzRhPCgu
            CxLpsQKBgQC5ePcDvRiOpswPMT1Vx1s9uigGmgfO9FqvmM4PUcXij3cD1ehhk+lE
            D/zcwudwEV090g09KvarXrC1CoQnm8VaI9G4Bv2MPccE5MckTiMjwufbMPUfY9ax
            iKCpLSc1ZKy8vms6H1zkgg1YdyHwbs7gCxnah/16bptfct4ZcF2uHg==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-controller-manager.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID7zCCAtegAwIBAgIRAMO0v3B17wbkPNs3BIyXfO4wDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDQwMzEzNDVaFw0yMTExMDQwMzEzNDVaMIGgMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxJzAlBgNVBAoTHnN5
            c3RlbTprdWJlLWNvbnRyb2xsZXItbWFuYWdlcjEgMB4GA1UECxMXS3ViZXJuZXRl
            cyBUaGUgSGFyZCBXYXkxJzAlBgNVBAMTHnN5c3RlbTprdWJlLWNvbnRyb2xsZXIt
            bWFuYWdlcjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAJyToum+hC/s
            3LrOUaqT2SzUGd+oKGWmkp+mT0+AWloexdW3vvi6XGKMVZUpw5xC4PMmhsBrAtc4
            d0GQvBKaauzpaQg6PG/L0R951zbwgwsN0I2HtQ6ZzKZJ/Pphpkk83UdBef4/7fv/
            LuB0arFJZBQeo4hPcYUqdKNlpx1QAlEb4ZqHtrNvWys6jNkgQt7sY7wuDB8Ll7Fc
            wicfLRmY7lYNZzMDRgoXrlbkk2Aq2QXcgG/xFmhblI79iJzqzZVpxnN6K4UVpX8O
            VfamiE2ZfgKakTVRl+ArJG+d5/Q+PPawEDOHu20PgY+FV9A7fKVZlnLx0SRxhhgC
            UWUWkYoCuzkCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsG
            AQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFBd8t1GS
            NHmBvG3UlZ6Hk4jID4nnMA0GCSqGSIb3DQEBCwUAA4IBAQBjKY8q0gGXVCakzKO9
            4DkCI9a/b8DRu/EmTFWTG/wpDuT/QlNp7cZjSQ0mwIcAU5YNYgYp9p734y9pmIDN
            cKGVtRGHK4qT9iE8666lUlbVMddRx8XKv2CMr6NHVO2xCmcvl+rKk7/Ur3tqcpa7
            K7iJO4qtKKANxLR3bbuK2dZkIgAVXi461gZ6bFGhqVFwB6PHQXNPzTKjUXHJWue7
            PDXvmsyKFJnxtcWHl9pUSLDxH/QsB7GPoIQnYJOppBM+wXrLVP/yOp2yh4KT2kxj
            PpwL2YjPQBjW5GR8POp1++zXzDm7FwwkZB9w+6xGK+7ktOYlzquvTBEIBKZvMBRg
            fuOv
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-controller-manager-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAnJOi6b6EL+zcus5RqpPZLNQZ36goZaaSn6ZPT4BaWh7F1be+
            +LpcYoxVlSnDnELg8yaGwGsC1zh3QZC8Eppq7OlpCDo8b8vRH3nXNvCDCw3QjYe1
            DpnMpkn8+mGmSTzdR0F5/j/t+/8u4HRqsUlkFB6jiE9xhSp0o2WnHVACURvhmoe2
            s29bKzqM2SBC3uxjvC4MHwuXsVzCJx8tGZjuVg1nMwNGCheuVuSTYCrZBdyAb/EW
            aFuUjv2InOrNlWnGc3orhRWlfw5V9qaITZl+ApqRNVGX4Cskb53n9D489rAQM4e7
            bQ+Bj4VX0Dt8pVmWcvHRJHGGGAJRZRaRigK7OQIDAQABAoIBAQCCG4QSa4d4M4Cv
            keX2smiSgaUGXrtCzImmNBJPY76wiEWoc8ky8dj24tny2wN6g3BdXDQ5DDMOGBOw
            3c4KP1p+hu4KMioqU9jwKNSXCIA73TzhflULTu3peC3I+P+ud+7/2P7AMOtWrROM
            2/AUZYHN3i/RgwI3v7GwXTXie6uRLScpLDuNVDasNMqx2dnDvfVQk5xiBr++pMkF
            KnCbvrvSjGz31V56SaIX1IL/zBztv+suf67yoZ2xLuSi6r0gmzCJB4+fEoVzt7Hy
            TgTjCGt5g/0R8DTeb6Y/M628ciUVGTtlgyh49SQrcmojT88lbJv54hSEEz2MFx4l
            4lBOUUmpAoGBAMoqCoWkRBSpFJb77xL5kQ0K9KEOej3r/V/CGmKNFol8aXoyWgep
            9+0YMa+7b759nJgUFeBx7DVeInO24SLS+aBsimOm7G0nigVPCF9gcac4nW+SqWDD
            uU6zRpiXzzizehV4MWdFldil7G9FKojScziSOM6DxLWjIKpkk1eeJwOLAoGBAMZF
            zG99JtZ5q6FPp+Bgvx1F+WqDAB0YUliBE3foHRUztTVd1xXHxxg7ewUrK6hqH1q9
            Cbuzb4LngCrrGU1KXfEAEEK8duniGj8GyEr5fAxLbNJBv1IqkrM/Ab2Hs3aqnn8J
            +uzRshChNeaNJO3R2RgiJi5wY4xc52VMRQhopkTLAoGBALhGnhS3aP9UJ9qAhqnL
            Jva2l8n/AlpTNEAHFDnk1Tg5WYPzRbFasw1BUnkW54LByO2u0UonTeJPjiPf/VPa
            74PVrEetrjDJK7wvEDiwFqkQqCE9lHsJrW4ZaC5Loq3Sm2PajV3PRgmXJO9AIsdY
            3YIhdvp3jeTrbykiSFRDatiFAoGBALqS18tZs4BDQfQrpseHgo+jVw6ZczPtvR83
            ZwCAVU2sOKqdQVZnhbwRzLOSaiSyqAqUtGICeb5u5bZ9QHPwtPGho6uI+UUg1J3W
            XgffOJHBMAeygrxo/17YvWSCG6hg6YCV/Z93u93WNYhb7RI1U9pX2CH+9E4S5lP2
            L0e4Yi19AoGAKoxkZg9BKEfhHH2zfPZDfoGZIOrpq7aHtJO0kfJPn5YzBg59OpUq
            I37nOuOB2L1zADRtVVTqYyLvEuceXsUxAT9cH7bc403LAsGO50f2YJxdLmJjohdR
            H7kscils17sD4XYR4GSWczM4h9r4ZoWVmYbkETFk0+rMsWLsHW5hCzM=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-scheduler.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID3TCCAsWgAwIBAgIRANsQyvr+f47GBxWbwkKie4QwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDQwMzEzNDVaFw0yMTExMDQwMzEzNDVaMIGOMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxHjAcBgNVBAoTFXN5
            c3RlbTprdWJlLXNjaGVkdWxlcjEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFy
            ZCBXYXkxHjAcBgNVBAMTFXN5c3RlbTprdWJlLXNjaGVkdWxlcjCCASIwDQYJKoZI
            hvcNAQEBBQADggEPADCCAQoCggEBAOE62UqYa9SMeyUH8ltLMkC8eAJrIwcYM64b
            ZpyuFv5TbIL5YyeYw4UTFoH/O8EsFSyJUIXTnmu0DcvrAUitnmqeeY+vgh2tqrLK
            XcrtDTc1sMap9Y/iI4Il4saQvZioRP/U4O6lZgQAa4oPWM6R+sPJfC/8bibH6z9E
            Wc9089wtELGJRJZq5zm4t4adQZEorcPOqca6MMyN80IITxwZl5FefjfKLDkaM7Qq
            nf/tV8lDzJ9KdFlMGuaJbcSEbOZWeyulVju3WW9WuZhHOHQeyjFQrXD0up90t+5w
            M5SF3Xj1HRtcgLkh3XJDPh8jz22zuYRoHovxxAYNiavTl2SH5SECAwEAAaNgMF4w
            DgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAM
            BgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFBd8t1GSNHmBvG3UlZ6Hk4jID4nnMA0G
            CSqGSIb3DQEBCwUAA4IBAQA6mFj8JdD94al/GvQ4gSOpfRptnbY+2nYXRnQwJWzn
            5G3fUqLe8qX8kqwk489SHjvEvGSzLvoUs0XKsayGQDQJ0qQXWWrcMi6Nfte5eQIu
            y03YNevizB5fE2NrSzeIE6dyQg6VWsG1N323YBx0TRqoENVRGujAwjLPj/5OqbmB
            VyU+pXpVuu4xKdRKrnLCjaOFuIIg9FgBTAvtb3KJIqRshBFci1OfoNGmm94n7Ely
            1oeCIuJEODRO0fb4tBR5+EmJstQaMSI6OitawONEQwKEX8+mmeCczOhVHkpBMY6e
            BBxkY6KDjZO1KD3z1kAJTbe7RUM1+nxdLPkGKndKFElZ
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-scheduler-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEogIBAAKCAQEA4TrZSphr1Ix7JQfyW0syQLx4AmsjBxgzrhtmnK4W/lNsgvlj
            J5jDhRMWgf87wSwVLIlQhdOea7QNy+sBSK2eap55j6+CHa2qsspdyu0NNzWwxqn1
            j+IjgiXixpC9mKhE/9Tg7qVmBABrig9YzpH6w8l8L/xuJsfrP0RZz3Tz3C0QsYlE
            lmrnObi3hp1BkSitw86pxrowzI3zQghPHBmXkV5+N8osORoztCqd/+1XyUPMn0p0
            WUwa5oltxIRs5lZ7K6VWO7dZb1a5mEc4dB7KMVCtcPS6n3S37nAzlIXdePUdG1yA
            uSHdckM+HyPPbbO5hGgei/HEBg2Jq9OXZIflIQIDAQABAoIBAB3iqSJ0xxoU6eIo
            A8iJWcmtOF9Zx/QRCgp4KE1x7Csi9qsKXFXMt2TY+4uUSmF/b+/Q6JZZVhQEeDAu
            pqT2JKcRECA4sZMukA/ZOkjK244P2b0CoErPPtbuIAEpA39WFJG9tXr1B2xQgfR3
            xNjkFdoUyh2z6QnMTTK/5wrYAeOc93h5nP+Ij5ROVb49j368wWjbOZM7UEDlTOoE
            sX8/yb48oJfZowGHR3n3T9AcyiwhYv2LKAfalHnx4Rr8nLxSyImRYwaTsB4ztQ9m
            yU/SAuyJjIxfTt86Ibj1CCS5wHE0kKK+AxgcZ78UERaLmK8LZ2G5MfRVJ/FlJDUn
            3qpqteECgYEA8Y4NG/amppwd9oN0tzxzFm2+NF8JJa1fWRqFnMcOPjweUweSI/C+
            bTHtXyjpAGjTdSl57eGV1uV+VfF9gIaeSAg3RqTzvRfYr/1EINkmb8rZsNG7PqeO
            hR4YvQszCPKqJBXn/2akZbYqZ0uK5K5P5Ksiy+MkRb9kQfEV6Lrgkv8CgYEA7rLh
            CBcBvy1TzhD0y3DYcUD3qI5oKwb/F+/h+ZNqs5d6I4UsLDj7qFOk0VgtQL2Yo8wQ
            5By6YJpovInZtqZjCY94/qIbQlIy0Ejw79hXLt+e/dxYAU96xxg1hGE7IIHoAQyP
            asS6O9AAz+t7Q+2qS6FwE9nQqh+m/uOZiWJ9J98CgYBlI0T54FwGhndFL+U+k2Dc
            kzaAVwpNbDnv5NrsuauNAz7vJMxboAEbVzw8C7UDJuDivWr/3uQOBijPcz1JAxRi
            tI3wVkB3e/SOO0y7NDCTvitHjYkIwr85nVBeVsIXjQMP+NwaY6+RpqQ6e7a76QAq
            jj0TgRc+3NPtiDPULeq5oQKBgAIn+4BnNMzVS/yAirWLv2jGfXY4UxiQZ51/vTrT
            6hLVO3U2rr93hE5w8vwxH7eF/ur73OsylzxoKKoLVLwhpKNheGZUcIqY03yuK/7+
            pUr3GiiQ5PqeDS3fOhyIBFC227Gmu2TrggMoTdmS9voWG4OzYZ/MR+ZBgvCqfaiQ
            CzFhAoGAcCoVuLAU633ddU5+z1NkAPij3eg90q2VndgEEzkjJDC0Kb+lmpfzAUAn
            zhQibHbDQgDVcTDwRtSAU0opz65KPuxb2Py3UAdfqKKE+7aX5UwzFxBW7x+Vm0Kv
            f4QQ5jRLQr6Qc7VQqJBF9aaHsU2bT2fQNxsSdRYK9yG1/IE8PR0=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/admin.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDxDCCAqygAwIBAgIQC6jlEgSumeaNxsKfx0b8ETANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwNDAzMTM0NVoXDTIxMTEwNDAzMTM0NVowdzELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRcwFQYDVQQKEw5zeXN0
            ZW06bWFzdGVyczEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFyZCBXYXkxDjAM
            BgNVBAMTBWFkbWluMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA06QH
            HkT21JoCP5zrTCA6pFxzMAQKE/qxTrp48G5wzgNbXR/0OM4lCyhoXFPsQ5XHnDC7
            CPi5nBKwA+S7sxrTWVDmc83CbVAdsjaxhWYvpqN+pw6zs9pS5mfI2m4R0Ja0pbBK
            f4MMPIriQt/90kZ3SvazsV5bleyFq3mWdv+vpb+tfWdjp5Kf5cIEokiiDmPiz0/5
            aw21fdLL1LEnD/iwriPhg9ljpASDmJXCUw8VtEqq3GwpjEfWVA8+Q9WZOc4TC/8D
            bFwvVSicLmvcXv+4gmzuOTcYq/0cJNwqwI+1U2FTRmiT5J8njG3OKclzvKVu9HXq
            zrkFwT4vA6TyS/HJiwIDAQABo2AwXjAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYw
            FAYIKwYBBQUHAwEGCCsGAQUFBwMCMAwGA1UdEwEB/wQCMAAwHwYDVR0jBBgwFoAU
            F3y3UZI0eYG8bdSVnoeTiMgPiecwDQYJKoZIhvcNAQELBQADggEBAI1HnuJ+JSjf
            Ihz8aplwUPEt1P0Xl0DS9wDJJL8WFxZgalltUlS+P0flLRZIM7VHf3RUrYDpWL3P
            4jjmwTzP7ZrrquH8/2UMWmDTej+32/TIh/lWZ/uDkH4T5p8I2dEYmkvt+Khr9WoB
            PVKZ3NdK+S8hE9uUDAjHxcPey8qFBckAkG3dDmfqhVxh6g9+t9kz0CVkhZqCtwbf
            ldU6xvZ47BWup34OcReSOADPT0mK/B5Tox5L8RcQA+uVrBT4byB/VYYkhY6FLIW9
            a3cVTpbEmdvO6EynasxtI0AQ5dz2hkoduA3wT0IP8lmC0igufYbuw4mBLaf/n7Ci
            Wiiv69yy+zs=
            -----END CERTIFICATE-----
            EOF
            cat > ~/admin-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEA06QHHkT21JoCP5zrTCA6pFxzMAQKE/qxTrp48G5wzgNbXR/0
            OM4lCyhoXFPsQ5XHnDC7CPi5nBKwA+S7sxrTWVDmc83CbVAdsjaxhWYvpqN+pw6z
            s9pS5mfI2m4R0Ja0pbBKf4MMPIriQt/90kZ3SvazsV5bleyFq3mWdv+vpb+tfWdj
            p5Kf5cIEokiiDmPiz0/5aw21fdLL1LEnD/iwriPhg9ljpASDmJXCUw8VtEqq3Gwp
            jEfWVA8+Q9WZOc4TC/8DbFwvVSicLmvcXv+4gmzuOTcYq/0cJNwqwI+1U2FTRmiT
            5J8njG3OKclzvKVu9HXqzrkFwT4vA6TyS/HJiwIDAQABAoIBADx48+e8QOMCln3i
            soDv/JGWMPuZS9/lk+Aw+/mHNQhIgUScqsXIcWE8zIUFHc857u08J1Uq7K4h0NVr
            +A33LkipCxAvzMw7RiDz68l4J0lwEfJeCw7q5SEcqpFvPfvh9AAb3U2N/mMWNAxz
            wCzjIZbz4uhdU8IE8TTL6yhZarDrDPc1OvkDQ37UM6rBGDX3IZ+i0/7V+YFr0603
            GufC2lzdt9mHKQ7iPpe3U2K3gavwWrI563gSjFCZtLKYC7fSEsMa3/WqVxeiitdG
            sWtEVe29YiB6WMIadY6nC4BwiAKOuS6KWNzYgp50v98D0lbNJHR5WQ8QoK4JKHO5
            /6FLR5ECgYEA5LERcB9VavI7jWSPr8c4DjSWZPyUxGEtJ1lHb9jDhTzWOGwVnqyv
            YRdcft5siqerSAhouyDUS/po4VYfnQxAgPEfrGiFHeHEfANG4rfaqQArWJ1UdLzP
            qglWhvaDVY+EsNlrqja/bOxLip/LDnYa4I8DdHVO/3+3b5zAVoPVKX8CgYEA7Om5
            sPOwR+zUp/psmGQ3kNBc84fKjVK17FJcyAvY3M/Sh/4MvH1X9Ug+qX5+OmYjjAYt
            S6soPHcmtuDnoh3Hm+6Oed5EwKgOYC2Hj0tctjy8Wa2Ko1OdORy+giOCguJdeNJg
            lNJbNhZXKlxPXPSF+Ra0sLDUahJBPQ1Xx8i6bfUCgYEAu5wXdif+ZxH5kPEif02r
            ytuRVZ9wW/pslI9Fb5ggLjnOc9MXmWiJJ9mGY/4MhWMvvJRJdtpjz0DKsbF5ldjr
            QdyN416Ldgw0qJf3mx7BH0uoQ7YuBuauZgvrFCU/cP2gGYUEMktflvfysPKOHnr9
            aaNpbiyedjRMRCAQGellAfkCgYBnR3TV+UYN9Oa32+nffUDj9pGu8LGSbk40mass
            4k1F5atn8Y5n1VS07yuyBBzPJJu2fTLd292MjnzoGJ+iAs1z4sllw0nBmwG5V9/S
            zg26vDt39LmNffP6Y9eBMC3DFR+efkfwWMu+hnq1UsyeP1LwRb+7jzrqis656Mkt
            pQnwyQKBgQCFEq2m+tKCC7gGAkmwrALfytvy0z9OKfjSfWwZyo0SbmcF2beon6rt
            tFoEDVqFT4gs2jPx+IQo+1cxliRiWmjFDBu7xZlOzW5k7P+TP+ufoYLEWLyQn3fG
            8UtYM671ETokV9HbOilbGomOS49JZ2wCPBfDLy3LeICu5EQFyqHxJw==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/apiserver_create_role.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRole
            metadata:
              annotations:
                rbac.authorization.kubernetes.io/autoupdate: "true"
              labels:
                kubernetes.io/bootstrapping: rbac-defaults
              name: system:kube-apiserver-to-kubelet
            rules:
              - apiGroups:
                  - ""
                resources:
                  - nodes/proxy
                  - nodes/stats
                  - nodes/log
                  - nodes/spec
                  - nodes/metrics
                verbs:
                  - "*"
            EOF
            cat > ~/apiserver_role_bind.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRoleBinding
            metadata:
              name: system:kube-apiserver
              namespace: ""
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: system:kube-apiserver-to-kubelet
            subjects:
              - apiGroup: rbac.authorization.k8s.io
                kind: User
                name: kubernetes
            EOF
            cd ~
            wget https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kubectl
            mv kubectl /usr/local/bin/
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-credentials system:kube-controller-manager --client-certificate=kube-controller-manager.pem --client-key=kube-controller-manager-key.pem --embed-certs=true --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-controller-manager --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config use-context default --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-credentials system:kube-scheduler --client-certificate=kube-scheduler.pem --client-key=kube-scheduler-key.pem --embed-certs=true --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-scheduler --kubeconfig=kube-scheduler.kubeconfig
            kubectl config use-context default --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=admin.kubeconfig
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem --embed-certs=true --kubeconfig=admin.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=admin --kubeconfig=admin.kubeconfig
            kubectl config use-context default --kubeconfig=admin.kubeconfig
            cat > encryption-config.yaml <<EOF
            kind: EncryptionConfig
            apiVersion: v1
            resources:
              - resources:
                  - secrets
                providers:
                  - aescbc:
                      keys:
                        - name: key1
                          secret: $(head -c 32 /dev/urandom | base64)
                  - identity: {}
            EOF
            wget -q --show-progress --https-only --timestamping https://github.com/etcd-io/etcd/releases/download/v3.4.10/etcd-v3.4.10-linux-amd64.tar.gz
            tar -xvf etcd-v3.4.10-linux-amd64.tar.gz
            mv etcd-v3.4.10-linux-amd64/etcd* /usr/local/bin/
            mkdir -p /etc/etcd /var/lib/etcd
            chmod 700 /var/lib/etcd
            cp ca.pem kubernetes-key.pem kubernetes.pem /etc/etcd/
            cat <<EOF | tee /etc/systemd/system/etcd.service
            Unit
            Description=etcd
            Documentation=https://github.com/coreos
            
            [Service]
            Type=notify
            ExecStart=/usr/local/bin/etcd \
              --name controller-1 \
              --cert-file=/etc/etcd/kubernetes.pem \
              --key-file=/etc/etcd/kubernetes-key.pem \
              --peer-cert-file=/etc/etcd/kubernetes.pem \
              --peer-key-file=/etc/etcd/kubernetes-key.pem \
              --trusted-ca-file=/etc/etcd/ca.pem \
              --peer-trusted-ca-file=/etc/etcd/ca.pem \
              --peer-client-cert-auth \
              --client-cert-auth \
              --initial-advertise-peer-urls https://10.240.0.11:2380 \
              --listen-peer-urls https://10.240.0.11:2380 \
              --listen-client-urls https://10.240.0.11:2379,https://127.0.0.1:2379 \
              --advertise-client-urls https://10.240.0.11:2379 \
              --initial-cluster-token etcd-cluster-0 \
              --initial-cluster controller-0=https://10.240.0.10:2380,controller-1=https://10.240.0.11:2380 \
              --initial-cluster-state new \
              --data-dir=/var/lib/etcd
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable etcd
            systemctl start etcd
            mkdir -p /etc/kubernetes/config
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-apiserver
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-controller-manager
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-scheduler
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kube-apiserver kube-controller-manager kube-scheduler kubectl
            mv kube-apiserver kube-controller-manager kube-scheduler kubectl /usr/local/bin/
            mkdir -p /var/lib/kubernetes/
            cp ca.pem /var/lib/kubernetes/
            mv ca-key.pem kubernetes-key.pem kubernetes.pem service-account-key.pem service-account.pem service-account-key.pem service-account.pem encryption-config.yaml /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-apiserver.service
            [Unit]
            Description=Kubernetes API Server
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-apiserver \
              --advertise-address=10.240.0.11 \
              --allow-privileged=true \
              --apiserver-count=2 \
              --audit-log-maxage=30 \
              --audit-log-maxbackup=3 \
              --audit-log-maxsize=100 \
             --audit-log-path=/var/log/audit.log \
            --authorization-mode=Node,RBAC \
            --bind-address=0.0.0.0 \
            --client-ca-file=/var/lib/kubernetes/ca.pem \
            --enable-admission-plugins=NamespaceLifecycle,NodeRestriction,LimitRanger,ServiceAccount,DefaultStorageClass,ResourceQuota \
            --etcd-cafile=/var/lib/kubernetes/ca.pem \
            --etcd-certfile=/var/lib/kubernetes/kubernetes.pem \
            --etcd-keyfile=/var/lib/kubernetes/kubernetes-key.pem \
            --etcd-servers=https://10.240.0.10:2379,https://10.240.0.11:2379 \
            --event-ttl=1h \
            --encryption-provider-config=/var/lib/kubernetes/encryption-config.yaml \
            --kubelet-certificate-authority=/var/lib/kubernetes/ca.pem \
            --kubelet-client-certificate=/var/lib/kubernetes/kubernetes.pem \
            --kubelet-client-key=/var/lib/kubernetes/kubernetes-key.pem \
            --kubelet-https=true \
            --runtime-config='api/all=true' \
            --service-account-key-file=/var/lib/kubernetes/service-account.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --service-node-port-range=30000-32767 \
            --tls-cert-file=/var/lib/kubernetes/kubernetes.pem \
            --tls-private-key-file=/var/lib/kubernetes/kubernetes-key.pem \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-controller-manager.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-controller-manager.service
            [Unit]
            Description=Kubernetes Controller Manager
            Documentation=https://github.com/kubernetes/kubernetes
            [Service]
            ExecStart=/usr/local/bin/kube-controller-manager \
            --bind-address=0.0.0.0 \
            --cluster-cidr=10.200.0.0/16 \
            --cluster-name=kubernetes \
            --cluster-signing-cert-file=/var/lib/kubernetes/ca.pem \
            --cluster-signing-key-file=/var/lib/kubernetes/ca-key.pem \
            --kubeconfig=/var/lib/kubernetes/kube-controller-manager.kubeconfig \
            --leader-elect=true \
            --root-ca-file=/var/lib/kubernetes/ca.pem \
            --service-account-private-key-file=/var/lib/kubernetes/service-account-key.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --use-service-account-credentials=true \
            --v=2
            Restart=on-failure
            RestartSec=5
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-scheduler.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/kubernetes/config/kube-scheduler.yaml
            apiVersion: kubescheduler.config.k8s.io/v1alpha1
            kind: KubeSchedulerConfiguration
            clientConnection:
              kubeconfig: "/var/lib/kubernetes/kube-scheduler.kubeconfig"
            leaderElection:
              leaderElect: true
            EOF
            cat <<EOF | tee /etc/systemd/system/kube-scheduler.service
            [Unit]
            Description=Kubernetes Scheduler
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-scheduler \
            --config=/etc/kubernetes/config/kube-scheduler.yaml \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable kube-apiserver kube-controller-manager kube-scheduler
            systemctl start kube-apiserver kube-controller-manager kube-scheduler
            apt-get update
            apt-get install -y nginx
            cat > kubernetes.default.svc.cluster.local <<EOF
            server {
            listen      80;
            server_name kubernetes.default.svc.cluster.local;
            location /healthz {
            proxy_pass                    https://127.0.0.1:6443/healthz;
            proxy_ssl_trusted_certificate /var/lib/kubernetes/ca.pem;
             }
            }
            EOF
            mv kubernetes.default.svc.cluster.local /etc/nginx/sites-available/kubernetes.default.svc.cluster.local
            ln /etc/nginx/sites-available/kubernetes.default.svc.cluster.local /etc/nginx/sites-enabled/
            systemctl restart nginx
            systemctl restart nginx
            if [ 1 = 0 ]; then
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_create_role.yaml
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_role_bind.yaml
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://34.87.208.7:6443
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem
            kubectl config set-context kubernetes-the-hard-way --cluster=kubernetes-the-hard-way --user=admin
            kubectl config use-context kubernetes-the-hard-way
            echo start sleep > sleep
            sleep 2m
            kubectl apply -f https://storage.googleapis.com/kubernetes-the-hard-way/coredns-1.7.0.yaml
            kubectl create secret generic kubernetes-the-hard-way --from-literal="mykey=mydata"
            rm sleep
            fi
            echo finished! > finished
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "controller-1"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "controller",
          + "kubernetes-the-hard-way",
        ]
      + tags_fingerprint        = (known after apply)
      + zone                    = "australia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = 200
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.240.0.11"
          + subnetwork         = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_target_pool.target-pool will be updated in-place
  ~ resource "google_compute_target_pool" "target-pool" {
        failover_ratio   = 0
        health_checks    = [
            "https://www.googleapis.com/compute/v1/projects/kube-293902/global/httpHealthChecks/kubernetes",
        ]
        id               = "projects/kube-293902/regions/australia-southeast1/targetPools/kubernetes-target-pool"
      ~ instances        = [
            "australia-southeast1-a/controller-0",
          + "australia-southeast1-a/controller-1",
        ]
        name             = "kubernetes-target-pool"
        project          = "kube-293902"
        region           = "australia-southeast1"
        self_link        = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/targetPools/kubernetes-target-pool"
        session_affinity = "NONE"
    }

  # kubernetes_deployment.nginx is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "nginx" {
      ~ id               = "default/scalable-nginx-example" -> (known after apply)
        wait_for_rollout = true

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
            labels           = {
                "App" = "ScalableNginxExample"
            }
            name             = "scalable-nginx-example"
            namespace        = "default"
          ~ resource_version = "37050" -> (known after apply)
          ~ self_link        = "/apis/apps/v1/namespaces/default/deployments/scalable-nginx-example" -> (known after apply)
          ~ uid              = "08bbd6fd-2d08-4b0d-96a6-35e80606b04a" -> (known after apply)
        }

      ~ spec {
            min_ready_seconds         = 60
            paused                    = false
            progress_deadline_seconds = 600
            replicas                  = 1
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "App" = "ScalableNginxExample"
                }
            }

          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                    labels           = {
                        "App" = "ScalableNginxExample"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = false -> null
                    dns_policy                       = "ClusterFirst"
                    enable_service_links             = true
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                    restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                        image                      = "nginx:1.7.8"
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "example"
                        stdin                      = false
                        stdin_once                 = false
                        termination_message_path   = "/dev/termination-log"
                      ~ termination_message_policy = "File" -> (known after apply)
                        tty                        = false

                      ~ port {
                            container_port = 80
                          - host_port      = 0 -> null
                            protocol       = "TCP"
                        }

                      ~ resources {
                          ~ limits {
                              ~ cpu    = "500m" -> "0.5"
                                memory = "512Mi"
                            }

                            requests {
                                cpu    = "250m"
                                memory = "50Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + quantity       = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # kubernetes_service.nginx will be created
  + resource "kubernetes_service" "nginx" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-example"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "App" = "ScalableNginxExample"
            }
          + session_affinity            = "None"
          + type                        = "NodePort"

          + port {
              + node_port   = 30201
              + port        = 80
              + protocol    = "TCP"
              + target_port = "80"
            }
        }
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```

</details>

*Pusher: @zcipod, Action: `pull_request`*